{
    "version": "https://jsonfeed.org/version/1",
    "title": "Jochen Stierberger",
    "feed_url": "undefined/rss/feed.json",
    "description": "Your blog description",
    "icon": "undefined/favicon.ico",
    "author": {
        "name": "Jochen Stierberger"
    },
    "items": [
        {
            "id": "undefined/articles/developer-productivity",
            "content_html": "<p>As a Software Developer, I know the importance of maximizing my time and being as productive as possible. I&#x27;ve always been on the lookout for ways to streamline my workflow and make the most of my time. Recently, I&#x27;ve discovered a set of software tools that have transformed the way I work. I&#x27;ve started using Tmux, Yabai, skhd, and LazyVim and they have made a world of difference in my productivity.</p>\n<h2>Yabai</h2>\n<p>Yabai is a powerful tiling window manager for macOS that has gained popularity among software developers for its ability to increase productivity and streamline workflow. I mostly use it for two things:</p>\n<ul>\n<li>\n<p>Tiling window management: I usually have multiple windows per display open at the same time and rely on Yabai&#x27;s binary space partitioning algorithm to automatically modifies my window layout.</p>\n</li>\n<li>\n<p>Keyboard shortcuts: Yabai allows you to define keyboard shortcuts using skhd or any other suitable software you may prefer. I use this functionality everyday as it saves me from using the mouse when switching between different displays.</p>\n</li>\n</ul>\n<p>Check out Josean&#x27;s <a href=\"https://www.josean.com/posts/yabai-setup\">walkthrough</a> on how to set up yabai.</p>\n<h2>Skhd</h2>\n<p>Skhd goes hand-in-hand with yabai and makes it super easy for me to jump between my monitors and even windows without using the mouse. I have a single key configured on my keyboard that acts as a hyper key on a press-and-hold. The Hyper key can normally be activated by pressing Shift+Control+Alt+Command simultaneously on macOS. Have a look at this excerpt of my skhd <a href=\"https://github.com/heyjochen/dotfiles/blob/main/skhd/skhdrc\">dotfiles</a> to see how easy it is to achieve this functionality:</p>\n<pre class=\"language-markdown\"><code class=\"language-markdown\"><span class=\"token title important\"><span class=\"token punctuation\">#</span> focus monitor 1/2/3</span>\n\nhyper - l : yabai -m display --focus 1\nhyper - u : yabai -m display --focus 2\nhyper - y : yabai -m display --focus 3\n\n<span class=\"token title important\"><span class=\"token punctuation\">#</span> moves focus between windows in the current focused display</span>\n\nhyper - m : yabai -m window --focus west\nhyper - n : yabai -m window --focus south\nhyper - e : yabai -m window --focus north\nhyper - i : yabai -m window --focus east\n</code></pre>\n<h2>Tmux</h2>\n<p>I usually work in at least three terminals at the same time and my screen got cluttered fast. Since switching over to Tmux, I am finally able create multiple terminal sessions within a single terminal window and switch between them easily. This can be useful for running multiple commands or programs at the same time, or for separating different tasks into separate sessions.</p>\n<figure><img alt=\"\" loading=\"lazy\" width=\"1500\" height=\"936\" decoding=\"async\" data-nimg=\"1\" style=\"color:transparent\" srcSet=\"/_next/image?url=%2F_next%2Fstatic%2Fmedia%2Fscreen-tmux.b84add81.webp&amp;w=1920&amp;q=75 1x, /_next/image?url=%2F_next%2Fstatic%2Fmedia%2Fscreen-tmux.b84add81.webp&amp;w=3840&amp;q=75 2x\" src=\"/_next/image?url=%2F_next%2Fstatic%2Fmedia%2Fscreen-tmux.b84add81.webp&amp;w=3840&amp;q=75\"/><figcaption style=\"border-radius:0%\"><p>Screenshot of my tmux environment when switching between different terminals</p></figcaption></figure>",
            "url": "undefined/articles/developer-productivity",
            "title": "My favorite tools as a dev",
            "summary": "Developer productivity is a crucial aspect of software development, and there are several tools that can help you improve it. Tmux, Yabai, skhd, and LazyVim are some of the tools that I personally use on a day-to-day basis and fully recommend.",
            "date_modified": "2023-05-14T00:00:00.000Z",
            "author": {
                "name": "Jochen Stierberger"
            }
        }
    ]
}